cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
		<register>
			<name>MADR</name>
			<description>MII Mgmt Address register.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REGADDR</name>
					<description>REGISTER ADDRESS. This field represents the 5-bit Register Address field of Mgmt cycles. Up to 32 registers can be accessed.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[7:5]</bitRange>
				</field>
				<field>
					<name>PHYADDR</name>
					<description>PHY ADDRESS. This field represents the 5-bit PHY Address field of Mgmt cycles. Up to 31 PHYs can be addressed (0 is reserved).</description>
					<bitRange>[12:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MWTD</name>
			<description>MII Mgmt Write Data register.</description>
			<addressOffset>0x02C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WRITEDATA</name>
					<description>WRITE DATA. When written, an MII Mgmt write cycle is performed using the 16-bit data and the pre-configured PHY and Register addresses from the MII Mgmt Address register (MADR).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MRDD</name>
			<description>MII Mgmt Read Data register.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>READDATA</name>
					<description>READ DATA. Following an MII Mgmt Read Cycle, the 16-bit data can be read from this location.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MIND</name>
			<description>MII Mgmt Indicators register.</description>
			<addressOffset>0x034</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BUSY</name>
					<description>When 1 is returned - indicates MII Mgmt is currently performing an MII Mgmt Read or Write cycle.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SCANNING</name>
					<description>When 1 is returned - indicates a scan operation (continuous MII Mgmt Read cycles) is in progress.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>NOTVALID</name>
					<description>When 1 is returned - indicates MII Mgmt Read cycle has not completed and the Read Data is not yet valid.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MIILINKFAIL</name>
					<description>When 1 is returned - indicates that an MII Mgmt link fail has occurred.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SA0</name>
			<description>Station Address 0 register.</description>
			<addressOffset>0x040</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SADDR2</name>
					<description>STATION ADDRESS, 2nd octet. This field holds the second octet of the station address.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SADDR1</name>
					<description>STATION ADDRESS, 1st octet. This field holds the first octet of the station address.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SA1</name>
			<description>Station Address 1 register.</description>
			<addressOffset>0x044</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SADDR4</name>
					<description>STATION ADDRESS, 4th octet. This field holds the fourth octet of the station address.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SADDR3</name>
					<description>STATION ADDRESS, 3rd octet. This field holds the third octet of the station address.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SA2</name>
			<description>Station Address 2 register.</description>
			<addressOffset>0x048</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SADDR6</name>
					<description>STATION ADDRESS, 6th octet. This field holds the sixth octet of the station address.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SADDR5</name>
					<description>STATION ADDRESS, 5th octet. This field holds the fifth octet of the station address.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>COMMAND</name>
			<description>Command register.</description>
			<addressOffset>0x100</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXENABLE</name>
					<description>Enable receive.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXENABLE</name>
					<description>Enable transmit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>REGRESET</name>
					<description>When a  1  is written, all datapaths and the host registers are reset. The MAC needs to be reset separately.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>TXRESET</name>
					<description>When a  1  is written, the transmit datapath is reset.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RXRESET</name>
					<description>When a  1  is written, the receive datapath is reset.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PASSRUNTFRAME</name>
					<description>When set to  1 , passes runt frames s1maller than 64 bytes to memory unless they have a CRC error. If 0 runt frames are filtered out.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PASSRXFILTER</name>
					<description>When set to  1 , disables receive filtering i.e. all frames received are written to memory.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>TXFLOWCONTROL</name>
					<description>Enable IEEE 802.3 / clause 31 flow control sending pause frames in full duplex and continuous preamble in half duplex.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RMII</name>
					<description>When set to  1 , RMII mode is selected; if 0, MII mode is selected.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>FULLDUPLEX</name>
					<description>When set to  1 , indicates full duplex operation.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STATUS</name>
			<description>Status register.</description>
			<addressOffset>0x104</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXSTATUS</name>
					<description>If 1, the receive channel is active. If 0, the receive channel is inactive.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXSTATUS</name>
					<description>If 1, the transmit channel is active. If 0, the transmit channel is inactive.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXDESCRIPTOR</name>
			<description>Receive descriptor base address register.</description>
			<addressOffset>0x108</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Fixed to 00</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>RXDESCRIPTOR</name>
					<description>MSBs of receive descriptor base address.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXSTATUS</name>
			<description>Receive status base address register.</description>
			<addressOffset>0x10C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Fixed to 000</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>RXSTATUS</name>
					<description>MSBs of receive status base address.</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXDESCRIPTORNUMBER</name>
			<description>Receive number of descriptors register.</description>
			<addressOffset>0x110</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXDESCRIPTORN</name>
					<description>RxDescriptorNumber. Number of descriptors in the descriptor array for which RxDescriptor is the base address. The number of descriptors is minus one encoded.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXPRODUCEINDEX</name>
			<description>Receive produce index register.</description>
			<addressOffset>0x114</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXPRODUCEIX</name>
					<description>Index of the descriptor that is going to be filled next by the receive datapath.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXCONSUMEINDEX</name>
			<description>Receive consume index register.</description>
			<addressOffset>0x118</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXCONSUMEIX</name>
					<description>Index of the descriptor that is going to be processed next by the receive</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXDESCRIPTOR</name>
			<description>Transmit descriptor base address register.</description>
			<addressOffset>0x11C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Fixed to 00</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>TXD</name>
					<description>TxDescriptor. MSBs of transmit descriptor base address.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXSTATUS</name>
			<description>Transmit status base address register.</description>
			<addressOffset>0x120</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Fixed to 00</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>TXSTAT</name>
					<description>TxStatus. MSBs of transmit status base address.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXDESCRIPTORNUMBER</name>
			<description>Transmit number of descriptors register.</description>
			<addressOffset>0x124</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXDN</name>
					<description>TxDescriptorNumber. Number of descriptors in the descriptor array for which TxDescriptor is the base address. The register is minus one encoded.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXPRODUCEINDEX</name>
			<description>Transmit produce index register.</description>
			<addressOffset>0x128</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXPI</name>
					<description>TxProduceIndex. Index of the descriptor that is going to be filled next by the transmit software driver.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXCONSUMEINDEX</name>
			<description>Transmit consume index register.</description>
			<addressOffset>0x12C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXCI</name>
					<description>TxConsumeIndex. Index of the descriptor that is going to be transmitted next by the transmit datapath.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TSV0</name>
			<description>Transmit status vector 0 register.</description>
			<addressOffset>0x158</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CRCERR</name>
					<description>CRC error. The attached CRC in the packet did not match the internally generated CRC.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>LCE</name>
					<description>Length check error. Indicates the frame length field does not match the actual number of data items and is not a type field.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>LOR</name>
					<description>Length out of range. Indicates that frame type/length field was larger than 1500 bytes. The EMAC doesn't distinguish the frame type and frame length, so, e.g. when the IP(0x8000) or ARP(0x0806) packets are received, it compares the frame type with the max length and gives the "Length out of range" error. In fact, this bit is not an error indication, but simply a statement by the chip regarding the status of the received frame.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DONE</name>
					<description>Transmission of packet was completed.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MULTICAST</name>
					<description>Packet's destination was a multicast address.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>BROADCAST</name>
					<description>Packet's destination was a broadcast address.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PACKETDEFER</name>
					<description>Packet was deferred for at least one attempt, but less than an excessive defer.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EXDF</name>
					<description>Excessive Defer. Packet was deferred in excess of 6071 nibble times in 100 Mbps or 24287 bit times in 10 Mbps mode.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EXCOL</name>
					<description>Excessive Collision. Packet was aborted due to exceeding of maximum allowed number of collisions.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>LCOL</name>
					<description>Late Collision. Collision occurred beyond collision window, 512 bit times.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>GIANT</name>
					<description>Byte count in frame was greater than can be represented in the transmit byte count field in TSV1.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>UNDERRUN</name>
					<description>Host side caused buffer underrun.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>TOTALBYTES</name>
					<description>The total number of bytes transferred including collided attempts.</description>
					<bitRange>[27:12]</bitRange>
				</field>
				<field>
					<name>CONTROLFRAME</name>
					<description>The frame was a control frame.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>PAUSE</name>
					<description>The frame was a control frame with a valid PAUSE opcode.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>BACKPRESSURE</name>
					<description>Carrier-sense method backpressure was previously applied.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>VLAN</name>
					<description>Frame's length/type field contained 0x8100 which is the VLAN protocol identifier.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TSV1</name>
			<description>Transmit status vector 1 register.</description>
			<addressOffset>0x15C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TBC</name>
					<description>Transmit byte count. The total number of bytes in the frame, not counting the collided bytes.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>TCC</name>
					<description>Transmit collision count. Number of collisions the current packet incurred during transmission attempts. The maximum number of collisions (16) cannot be represented.</description>
					<bitRange>[19:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
