cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
				</field>
				<field>
					<name>EPNDDINTCLR3</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR4</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR5</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR6</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR7</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR8</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR9</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR10</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR11</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR12</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR13</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR14</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR15</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR16</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[16:16]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR17</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[17:17]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR18</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[18:18]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR19</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[19:19]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR20</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[20:20]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR21</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[21:21]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR22</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[22:22]</bitRange>
										
				</field>
				<field>
					<name>EPNDDINTCLR23</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Clear the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
					<bitRange>[23:23]</bitRange>
										
