cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
			</field>							
		</fields>								
	</register>	
		<register>			
			<name>USBCLKST</name>		
			<description>USB Clock Status</description>		
			
			<addressOffset>0xFF8</addressOffset>		
			<access>read-only</access>		
			<resetValue>0</resetValue>		
			<resetMask>0xFFFFFFFF</resetMask>		
			<fields>		
				<field>	
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[0:0]</bitRange>
				</field>	
				<field>	
					<name>DEV_CLK_ON</name>
					<description>Device clock on. The usbclk input to the device controller is active	.</description>
					<bitRange>[1:1]</bitRange>
				</field>	
				<field>	
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[2:2]</bitRange>
				</field>	
				<field>	
					<name>PORTSEL_CLK_ON</name>
					<description>Port select register clock on.</description>
					<bitRange>[3:3]</bitRange>
				</field>	
				<field>	
					<name>AHB_CLK_ON</name>
					<description>AHB clock on.</description>
					<bitRange>[4:4]</bitRange>
				</field>	
				<field>	
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:5]</bitRange>
				</field>	
			</fields>		
		</register>
	<register>									
		<name>OTGCLKST</name>								
		<description>OTG clock status</description>	
		<alternateRegister>USBCLKST</alternateRegister>
		<addressOffset>0xFF8</addressOffset>								
		<access>read-only</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>HOST_CLK_ON</name>						
				<description>Host clock status.</description>						
				<bitRange>[0:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>HOST_CLOCK_IS_NOT_AV</name>				
						<description>Host clock is not available.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>HOST_CLOCK_IS_AVAILA</name>				
						<description>Host clock is available.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>DEV_CLK_ON</name>						
				<description>Device clock status.</description>						
				<bitRange>[1:1]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DEVICE_CLOCK_IS_NOT_</name>				
						<description>Device clock is not available.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>DEVICE_CLOCK_IS_AVAI</name>				
						<description>Device clock is available.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>I2C_CLK_ON</name>						
				<description>I2C clock status.</description>						
				<bitRange>[2:2]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>I2C_CLOCK_IS_NOT_AVA</name>				
						<description>I2C clock is not available.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>I2C_CLOCK_IS_AVAILAB</name>				
						<description>I2C clock is available.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>OTG_CLK_ON</name>						
				<description>OTG clock status.</description>						
				<bitRange>[3:3]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>OTG_CLOCK_IS_NOT_AVA</name>				
						<description>OTG clock is not available.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>OTG_CLOCK_IS_AVAILAB</name>				
						<description>OTG clock is available.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>AHB_CLK_ON</name>						
				<description>AHB master clock status.</description>						
				<bitRange>[4:4]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>AHB_CLOCK_IS_NOT_AVA</name>				
						<description>AHB clock is not available.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>AHB_CLOCK_IS_AVAILAB</name>				
						<description>AHB clock is available.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved. Read value is undefined, only zero should be written.</description>						
				<bitRange>[31:5]</bitRange>						
					
			</field>							
		</fields>								
	</register>									

					
					
		
										
										
	</registers>
		</peripheral>

		<peripheral>
			<name>CRC</name>
			<description>CRC engine </description>
			<groupName>CRC</groupName>
			<baseAddress>0x20090000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODE</name>
					<description>CRC mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_POLY</name>
							<description>Select CRC polynomial</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CRC_CCITT_POLYNOMIAL</name>
									<description>CRC-CCITT polynomial</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_16_POLYNOMIAL</name>
									<description>CRC-16 polynomial</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_32_POLYNOMIAL</name>
									<description>CRC-32 polynomial</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIT_RVS_WR</name>
							<description>Select bit order for CRC_WR_DATA</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_BIT_ORDER_REVERSE</name>
									<description>No bit order reverse for CRC_WR_DATA (per byte)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT_ORDER_REVERSE_FO</name>
									<description>Bit order reverse for CRC_WR_DATA (per byte)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL_WR</name>
							<description>Select one's complement for CRC_WR_DATA</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ONES_COMPLEMENT_</name>
									<description>No one's complement for CRC_WR_DATA</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONES_COMPLEMENT_FOR</name>
									<description>One's complement for CRC_WR_DATA</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIT_RVS_SUM</name>
							<description>Select bit order revers for CRC_SUM</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_BIT_ORDER_REVERSE</name>
									<description>No bit order reverse for CRC_SUM</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIT_ORDER_REVERSE_FO</name>
									<description>Bit order reverse for CRC_SUM</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL_SUM</name>
							<description>Select one's complement for CRC_SUM</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ONES_COMPLEMENT_</name>
									<description>No one's complement for CRC_SUM</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONES_COMPLEMENT_FOR</name>
									<description>One's complement for CRC_SUM</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Reserved</name>
							<description>Always 0 when read</description>
							<bitRange>[31:6]</bitRange>
						
