cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
		<register>
			<name>CLR0</name>
			<description>GPIO Interrupt Clear.</description>
			<addressOffset>0x00C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P0_0CI</name>
					<description>Clear GPIO port Interrupts for P0[0]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P0_1CI</name>
					<description>Clear GPIO port Interrupts for P0[1]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P0_2CI</name>
					<description>Clear GPIO port Interrupts for P0[2]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P0_3CI</name>
					<description>Clear GPIO port Interrupts for P0[3]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P0_4CI</name>
					<description>Clear GPIO port Interrupts for P0[4]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P0_5CI</name>
					<description>Clear GPIO port Interrupts for P0[5]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P0_6CI</name>
					<description>Clear GPIO port Interrupts for P0[6]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P0_7CI</name>
					<description>Clear GPIO port Interrupts for P0[7]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P0_8CI</name>
					<description>Clear GPIO port Interrupts for P0[8]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P0_9CI</name>
					<description>Clear GPIO port Interrupts for P0[9]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P0_10CI</name>
					<description>Clear GPIO port Interrupts for P0[10]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P0_11CI</name>
					<description>Clear GPIO port Interrupts for P0[11]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P0_12CI</name>
					<description>Clear GPIO port Interrupts for P0[12]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P0_13CI</name>
					<description>Clear GPIO port Interrupts for P0[13]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>P0_14CI</name>
					<description>Clear GPIO port Interrupts for P0[14]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>P0_15CI</name>
					<description>Clear GPIO port Interrupts for P0[15]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>P0_16CI</name>
					<description>Clear GPIO port Interrupts for P0[16]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>P0_17CI</name>
					<description>Clear GPIO port Interrupts for P0[17]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>P0_18CI</name>
					<description>Clear GPIO port Interrupts for P0[18]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>P0_19CI</name>
					<description>Clear GPIO port Interrupts for P0[19]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>P0_20CI</name>
					<description>Clear GPIO port Interrupts for P0[20]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>P0_21CI</name>
					<description>Clear GPIO port Interrupts for P0[21]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>P0_22CI</name>
					<description>Clear GPIO port Interrupts for P0[22]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>P0_23CI</name>
					<description>Clear GPIO port Interrupts for P0[23]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>P0_24CI</name>
					<description>Clear GPIO port Interrupts for P0[24]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>P0_25CI</name>
					<description>Clear GPIO port Interrupts for P0[25]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>P0_26CI</name>
					<description>Clear GPIO port Interrupts for P0[26]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>P0_27CI</name>
					<description>Clear GPIO port Interrupts for P0[27]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>P0_28CI</name>
					<description>Clear GPIO port Interrupts for P0[28]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>P0_29CI</name>
					<description>Clear GPIO port Interrupts for P0[29]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>P0_30CI</name>
					<description>Clear GPIO port Interrupts for P0[30]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>P0_31CI</name>
					<description>Clear GPIO port Interrupts for P0[31]. 0 = No effect. 1 = Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENR0</name>
			<description>GPIO Interrupt Enable for Rising edge for Port 0.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P0_0ER</name>
					<description>Enable rising edge interrupt for P0[0]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P0_1ER</name>
					<description>Enable rising edge interrupt for P0[1]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P0_2ER</name>
					<description>Enable rising edge interrupt for P0[2]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P0_3ER</name>
					<description>Enable rising edge interrupt for P0[3]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P0_4ER</name>
					<description>Enable rising edge interrupt for P0[4]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P0_5ER</name>
					<description>Enable rising edge interrupt for P0[5]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P0_6ER</name>
					<description>Enable rising edge interrupt for P0[6]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P0_7ER</name>
					<description>Enable rising edge interrupt for P0[7]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P0_8ER</name>
					<description>Enable rising edge interrupt for P0[8]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P0_9ER</name>
					<description>Enable rising edge interrupt for P0[9]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P0_10ER</name>
					<description>Enable rising edge interrupt for P0[10]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P0_11ER</name>
					<description>Enable rising edge interrupt for P0[11]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P0_12ER</name>
					<description>Enable rising edge interrupt for P0[12]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P0_13ER</name>
					<description>Enable rising edge interrupt for P0[13]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>P0_14ER</name>
					<description>Enable rising edge interrupt for P0[14]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>P0_15ER</name>
					<description>Enable rising edge interrupt for P0[15]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>P0_16ER</name>
					<description>Enable rising edge interrupt for P0[16]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>P0_17ER</name>
					<description>Enable rising edge interrupt for P0[17]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>P0_18ER</name>
					<description>Enable rising edge interrupt for P0[18]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>P0_19ER</name>
					<description>Enable rising edge interrupt for P0[19]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>P0_20ER</name>
					<description>Enable rising edge interrupt for P0[20]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>P0_21ER</name>
					<description>Enable rising edge interrupt for P0[21]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>P0_22ER</name>
					<description>Enable rising edge interrupt for P0[22]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>P0_23ER</name>
					<description>Enable rising edge interrupt for P0[23]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>P0_24ER</name>
					<description>Enable rising edge interrupt for P0[24]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>P0_25ER</name>
					<description>Enable rising edge interrupt for P0[25]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>P0_26ER</name>
					<description>Enable rising edge interrupt for P0[26]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>P0_27ER</name>
					<description>Enable rising edge interrupt for P0[27]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>P0_28ER</name>
					<description>Enable rising edge interrupt for P0[28]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>P0_29ER</name>
					<description>Enable rising edge interrupt for P0[29]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>P0_30ER</name>
					<description>Enable rising edge interrupt for P0[30]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>P0_31ER</name>
					<description>Enable rising edge interrupt for P0[31]. 0 = Disable rising edge interrupt. 1 = Enable rising edge interrupt.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENF0</name>
			<description>GPIO Interrupt Enable for Falling edge for Port 0.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P0_0EF</name>
					<description>Enable falling edge interrupt for P0[0]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>P0_1EF</name>
					<description>Enable falling edge interrupt for P0[1]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>P0_2EF</name>
					<description>Enable falling edge interrupt for P0[2]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>P0_3EF</name>
					<description>Enable falling edge interrupt for P0[3]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>P0_4EF</name>
					<description>Enable falling edge interrupt for P0[4]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>P0_5EF</name>
					<description>Enable falling edge interrupt for P0[5]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>P0_6EF</name>
					<description>Enable falling edge interrupt for P0[6]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>P0_7EF</name>
					<description>Enable falling edge interrupt for P0[7]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>P0_8EF</name>
					<description>Enable falling edge interrupt for P0[8]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>P0_9EF</name>
					<description>Enable falling edge interrupt for P0[9]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>P0_10EF</name>
					<description>Enable falling edge interrupt for P0[10]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>P0_11EF</name>
					<description>Enable falling edge interrupt for P0[11]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>P0_12EF</name>
					<description>Enable falling edge interrupt for P0[12]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>P0_13EF</name>
					<description>Enable falling edge interrupt for P0[13]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>P0_14EF</name>
					<description>Enable falling edge interrupt for P0[14]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>P0_15EF</name>
					<description>Enable falling edge interrupt for P0[15]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>P0_16EF</name>
					<description>Enable falling edge interrupt for P0[16]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>P0_17EF</name>
					<description>Enable falling edge interrupt for P0[17]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>P0_18EF</name>
					<description>Enable falling edge interrupt for P0[18]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>P0_19EF</name>
					<description>Enable falling edge interrupt for P0[19]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>P0_20EF</name>
					<description>Enable falling edge interrupt for P0[20]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>P0_21EF</name>
					<description>Enable falling edge interrupt for P0[21]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>P0_22EF</name>
					<description>Enable falling edge interrupt for P0[22]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>P0_23EF</name>
					<description>Enable falling edge interrupt for P0[23]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>P0_24EF</name>
					<description>Enable falling edge interrupt for P0[24]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>P0_25EF</name>
					<description>Enable falling edge interrupt for P0[25]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>P0_26EF</name>
					<description>Enable falling edge interrupt for P0[26]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>P0_27EF</name>
					<description>Enable falling edge interrupt for P0[27]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>P0_28EF</name>
					<description>Enable falling edge interrupt for P0[28]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>P0_29EF</name>
					<description>Enable falling edge interrupt for P0[29]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>P0_30EF</name>
					<description>Enable falling edge interrupt for P0[30]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>P0_31EF</name>
					<description>Enable falling edge interrupt for P0[31]. 0 = Disable falling edge interrupt. 1 = Enable falling edge interrupt.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
