cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
	</registers>
		</peripheral>
		
		<peripheral>
			<name>IOCON</name>
			<description>IOCON pin configuration</description>
			<baseAddress>0x4002C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
		
<registers>
   <register>
      <name>P0_0</name>
      <description>I/O configuration register for pin P0[0]</description>
      <addressOffset>0x0</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[0]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_0</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CAN_RD1</name>
                  <description>CAN1 receiver input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U3_TXD</name>
                  <description>Transmitter output for UART3.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1 data input/output(this pin does not use a specialized I2C                                             pad).</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U0_TXD</name>
                  <description>Transmitter output for UART0.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P0_1</name>
      <description>I/O configuration register for pin P0[1]</description>
      <addressOffset>0x4</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[1]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_1</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CAN_TD1</name>
                  <description>CAN1 transmitter output.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U3_RXD</name>
                  <description>Receiver input for UART3.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1 clock                                             input/output (this pin does not use a specialized I2C                                             pad).</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U0_RXD</name>
                  <description>Receiver input for UART0.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P0_2</name>
      <description>I/O configuration register for pin P0[2]</description>
      <addressOffset>0x8</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[2]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_2</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U0_TXD</name>
                  <description>Transmitter output for UART0.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U3_TXD</name>
                  <description>Transmitter output for UART3.</description>
                  <value>0x2</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
