cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
   <register>
      <name>P0_13</name>
      <description>I/O configuration register for pin P0[13]</description>
      <addressOffset>0x34</addressOffset>
      <access>read-write</access>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[13]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_13</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>USB_UP_LED2</name>
                  <description>USB port 2 GoodLink LED indicator. It is LOW when                                             the device is configured (non-control endpoints                                             enabled), or when the host is enabled and has detected a                                             device on the bus. It is HIGH when the device is not                                             configured, or when host is enabled and has not detected                                             a device on the bus, or during global suspend. It                                             transitions between LOW and HIGH (flashes) when the host                                             is enabled and detects activity on the bus.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SSP1_MOSI</name>
                  <description>Master Out Slave In for SSP1.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ADC0_IN_7</name>
                  <description>A/D converter 0, input 7. When configured as an                                             ADC input, the digital function of the pin must be                                             disabled.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
      </fields>
   </register>
   <register>
      <name>P0_14</name>
      <description>I/O configuration register for pin P0[14]</description>
      <addressOffset>0x38</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[14]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_14</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>USB_HSTEN2</name>
                  <description>Host Enabled status for USB port 2.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SSP1_SSEL</name>
                  <description>Slave Select for SSP1.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>USB_CONNECT2</name>
                  <description>SoftConnect control for USB port 2. Signal used                                             to switch an external 1.5 kW                                             resistor under software control. Used with the                                             SoftConnect USB feature.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P0_15</name>
      <description>I/O configuration register for pin P0[15]</description>
      <addressOffset>0x3C</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[15]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_15</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U1_TXD</name>
                  <description>Transmitter output for UART1.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SSP0_SCK</name>
                  <description>Serial clock for SSP0.</description>
                  <value>0x2</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P0_16</name>
      <description>I/O configuration register for pin P0[16]</description>
      <addressOffset>0x40</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P0[16]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P0_16</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U1_RXD</name>
                  <description>Receiver input for UART1.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SSP0_SSEL</name>
                  <description>Slave Select for SSP0.</description>
                  <value>0x2</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
