cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
						</field>
					</fields>
				</register>
				<register>
					<name>CNTVAL</name>
					<description>DAC Counter Value register. This register contains the reload value for the DAC DMA/Interrupt timer.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VALUE</name>
							<description>16-bit reload value for the DAC interrupt/DMA timer.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		<peripheral derivedFrom="TIMER0">
			<name>TIMER2</name>
			<baseAddress>0x40090000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER2</name>
				<value>3</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="TIMER0">
			<name>TIMER3</name>
			<baseAddress>0x40094000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER3</name>
				<value>4</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="UART0">
			<name>UART2</name>
			<baseAddress>0x40098000</baseAddress>
			
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2</name>
				<value>7</value>
			</interrupt>
			
		</peripheral>	
		<peripheral derivedFrom="UART0">
			<name>UART3</name>
			<baseAddress>0x4009C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART3</name>
				<value>8</value>
			</interrupt>
			
		</peripheral>
		<peripheral derivedFrom="I2C0">
			<name>I2C2</name>
			<baseAddress>0x400A0000</baseAddress>
			<interrupt>
				<name>I2C2</name>
				<value>12</value>
				
			</interrupt>
		</peripheral>
		<peripheral>
	<name>UART4</name>
	<description>UART4 </description>
	<groupName>UART4</groupName>
	<baseAddress>0x400A4000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART4</name>
	<value>35</value>
	</interrupt>
	<registers>
		<register>
			<name>RBR</name>
			<description>Receiver Buffer Register. Contains the next received character to be read (DLAB =0).</description>
			<addressOffset>0x000</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RBR</name>
					<description>The UART4 Receiver Buffer Register contains the oldest received byte in the UART4 Rx FIFO.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, the value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>THR</name>
			<description>Transmit Holding Register. The next character to be transmitted is written here (DLAB =0).</description>
			<alternateRegister>RBR</alternateRegister>
			<addressOffset>0x000</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>THR</name>
					<description>Writing to the UART4 Transmit Holding Register causes the data to be stored in the UART4 transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DLL</name>
			<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB =1).</description>
			<alternateRegister>RBR</alternateRegister>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x01</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DLLSB</name>
					<description>The UART4 Divisor Latch LSB Register, along with the U4DLM register, determines the baud rate of the UART4.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DLM</name>
			<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB =1).</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x01</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DLMSB</name>
					<description>The UART4 Divisor Latch MSB Register, along with the U0DLL register, determines the baud rate of the UART4.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IER</name>
			<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts (DLAB =0).</description>
			<alternateRegister>DLM</alternateRegister>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RBRIE</name>
					<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for UARTn. It also controls the Character Receive Time-out interrupt.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_THE_RDA_INTE</name>
							<description>Disable the RDA interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_THE_RDA_INTER</name>
							<description>Enable the RDA interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>THREIE</name>
					<description>THRE Interrupt Enable. Enables the THRE interrupt for UARTn. The status of this can be read from UnLSR[5].</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_THE_THRE_INT</name>
							<description>Disable the THRE interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_THE_THRE_INTE</name>
							<description>Enable the THRE interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXIE</name>
					<description>RX Line Status Interrupt Enable. Enables the UARTn RX line status interrupts. The status of this interrupt can be read from UnLSR[4:1].</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_THE_RX_LINE_</name>
							<description>Disable the RX line status interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_THE_RX_LINE_S</name>
							<description>Enable the RX line status interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:3]</bitRange>

