cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x_v0.8.svd
				</field>
			</fields>
		</register>
		<register>
			<name>LSR</name>
			<description>Line Status Register. Contains flags for transmit and receive status, including line errors.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-only</access>
			<resetValue>0x60</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RDR</name>
					<description>Receiver Data Ready. UnLSR[0] is set when the UnRBR holds an unread character and is cleared when the UARTn RBR FIFO is empty.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_UARTN_RECEIVER_F</name>
							<description>The UARTn receiver FIFO is empty.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_UARTN_RECEIVER_F</name>
							<description>The UARTn receiver FIFO is not empty.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OE</name>
					<description>Overrun Error. The overrun error condition is set as soon as it occurs. An UnLSR read clears UnLSR[1]. UnLSR[1] is set when UARTn RSR has a new character assembled and the UARTn RBR FIFO is full. In this case, the UARTn RBR FIFO will not be overwritten and the character in the UARTn RSR will be lost.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>OVERRUN_ERROR_STATUS</name>
							<description>Overrun error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OVERRUN_ERROR_STATUS</name>
							<description>Overrun error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PE</name>
					<description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. An UnLSR read clears UnLSR[2]. Time of parity error detection is dependent on UnFCR[0]. Note: A parity error is associated with the character at the top of the UARTn RBR FIFO.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>PARITY_ERROR_STATUS_</name>
							<description>Parity error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PARITY_ERROR_STATUS_</name>
							<description>Parity error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FE</name>
					<description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. An UnLSR read clears UnLSR[3]. The time of the framing error detection is dependent on UnFCR[0]. Upon detection of a framing error, the Rx will attempt to resynchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the UARTn RBR FIFO.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FRAMING_ERROR_STATUS</name>
							<description>Framing error status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FRAMING_ERROR_STATUS</name>
							<description>Framing error status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BI</name>
					<description>Break Interrupt. When RXDn is held in the spacing state (all zeroes) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXDn goes to marking state (all ones). An UnLSR read clears this status bit. The time of break detection is dependent on UnFCR[0]. Note: The break interrupt is associated with the character at the top of the UARTn RBR FIFO.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BREAK_INTERRUPT_STAT</name>
							<description>Break interrupt status is inactive.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BREAK_INTERRUPT_STAT</name>
							<description>Break interrupt status is active.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>THRE</name>
					<description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty UARTn THR and is cleared on a UnTHR write.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNTHR_CONTAINS_VALID</name>
							<description>UnTHR contains valid data.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UNTHR_IS_EMPTY_</name>
							<description>UnTHR is empty.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TEMT</name>
					<description>Transmitter Empty. TEMT is set when both UnTHR and UnTSR are empty; TEMT is cleared when either the UnTSR or the UnTHR contain valid data.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VALID_DATA</name>
							<description>UnTHR and/or the UnTSR contains valid data.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EMPTY</name>
							<description>UnTHR and the UnTSR are empty.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXFE</name>
					<description>Error in RX FIFO . UnLSR[7] is set when a character with a Rx error such as framing error, parity error or break interrupt, is loaded into the UnRBR. This bit is cleared when the UnLSR register is read and there are no subsequent errors in the UARTn FIFO.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNRBR_CONTAINS_NO_UA</name>
							<description>UnRBR contains no UARTn RX errors or UnFCR[0]=0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UARTN_RBR_CONTAINS_A</name>
							<description>UARTn RBR contains at least one UARTn RX error.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>

